//сначала объявляются переменные (a и b с присвоением значения, c и d нет)
var a = 1, b = 1, c, d;

//переменной c присвоено значение 2, затем возвращено, постфиксная форма
c = ++a; alert(c); // 2

//переменной d присвоено значение 2, но возвращено 1, постфиксная форма
d = b++; alert(d); // 1

// сначала переменной a присваивается значение 3, потом вычисляется

// переменная b увеличена до 3, но при вычислении остается старое значение
d = (2+ b++); alert(d); // 4

// каждую переменную увеличили по 2 раза
alert(a); // 3
alert(b); // 3



